examples/dfHighSpeedFoam/twoD_RiemannProblem/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  200;

method          simple;

simpleCoeffs
{
    n               (200 1 1);
    delta           0;
}

constraints
{
    dfRefinementHistory
    {
        //- Decompose cells such that all cell originating from single cell
        //  end up on same processor
        type    dfRefinementHistory;
    }
}

// ************************************************************************* //
